---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem.Dispose
source: html/ede964ad-7fec-c810-32b3-37ef6cb7ca47.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryPressureDropUIDataItem

## Syntax (C#)
```csharp
public void Dispose()
```